RIET/src/ExchangePlans/Leg7/Leg7.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="1b51ab19-fe58-4529-9962-96b0eb7270f6">
  <name>Leg7</name>
  <attributes>
    <name>ServiceProvider</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьВСтандартныеЕдиницыИзмерения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АрхивироватьФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияРазмеров</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьТолькоИмпортныеПарсели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьLEвТрипах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AdditionalInfoReport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Leg6Report</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольЗаполненностиNetWeight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьФайлВОтчетеОбОшибках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменятьСкладUNKN</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаСкладаUNKN</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйСоставРедактируемыхПолейLeg6</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьПроверкуСоставаИмпортныхПарселей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExportReports</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДатыНачалаВыгрузкиДокументовПоСкладам</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаВыгрузкиДокументов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключаемыеБрокеры</name>
    <attributes>
      <name>Agent</name>
      <type>
        <types>CatalogRef.Agents</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ProcessLevels</name>
    <attributes>
      <name>ProcessLevel</name>
      <type>
        <types>CatalogRef.ProcessLevels</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

RIET/src/Documents/КонсолидированныйПакетЗаявокНаПеревозку/КонсолидированныйПакетЗаявокНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонсолидированныйПакетЗаявокНаПеревозку</name>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <attributes>
    <name>ИмпортЭкспорт</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>POD</name>
    <type>
      <types>CatalogRef.CountriesHUBs</types>
    </type>
  </attributes>
  <attributes>
    <name>DirectlyToTheHub</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Seller</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>MOT</name>
    <type>
      <types>CatalogRef.MOTs</types>
    </type>
  </attributes>
  <attributes>
    <name>RequestedPOA</name>
    <type>
      <types>CatalogRef.SeaAndAirPorts</types>
    </type>
  </attributes>
  <attributes>
    <name>Urgency</name>
    <type>
      <types>EnumRef.Urgencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВажности</name>
    <type>
      <types>EnumRef.СтатусыВажности</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>600</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRequested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Requested</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Accepted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCAFirstResponse</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Granted</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Booked</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStage</name>
    <type>
      <types>EnumRef.DOCStages</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatus</name>
    <type>
      <types>EnumRef.DOCStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentStatusDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WithoutGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HouseKeeping</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CurrentComment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>POList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>650</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>SegmentsList</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SanctionedItems</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PendingEUC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PermitsRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>COORequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>FormalGreenLight</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GuaranteeLetterRequired</name>
    <type>
      <types>EnumRef.YesNo</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SentToTMSDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceLocation</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionSpecialist</name>
    <type>
      <types>CatalogRef.SLSRCA</types>
    </type>
  </attributes>
  <attributes>
    <name>SubmittedByTransactionSpecialist</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>GL_FromSegment</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CCAReference</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CCA_Coordinator</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ReRoute</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NumberOfUniqueLines</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Инвойсы</name>
    <attributes>
      <name>Инвойс</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ManualStatuses</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>EnumRef.DOCStatuses</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Version</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Parcels</name>
    <attributes>
      <name>Parcel</name>
      <type>
        <types>CatalogRef.Parcels</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TMS_OB</name>
    <attributes>
      <name>OBNo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ApprovalBorgs</name>
    <attributes>
      <name>Borg</name>
      <type>
        <types>CatalogRef.BORGs</types>
      </type>
    </attributes>
    <attributes>
      <name>Approve</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ApproveDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TNVEDCodesOfBroker</name>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.Инвойс</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>TNVEDBroker</name>
      <type>
        <types>CatalogRef.TNVEDCodes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/ExchangePlans/Leg7/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// { RGS VShamin 27.07.2015 20:11:54 - S-I-0001168
//Функция ПолучитьСписокЗарегистрированныхПарселей(УзелОбмена) Экспорт
Функция ПолучитьСписокЗарегистрированныхПарселей(УзелОбмена, НастройкаОбмена) Экспорт
// } RGS VShamin 27.07.2015 20:11:58 - S-I-0001168
	
	МассивПарселей = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		
		// { RGS VShamin 27.07.2015 19:29:27 - S-I-0001168
		//ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, УзелОбмена.НомерОтправленного + 1);
		//Пока ВыборкаИзменений.Следующий() Цикл
		//	Данные = ВыборкаИзменений.Получить();
		//	Если ТипЗнч(Данные) = Тип("СправочникОбъект.Parcels") Тогда
		//		МассивПарселей.Добавить(Данные.Ссылка);
		//	КонецЕсли;
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ParcelsИзменения.Ссылка,
		               |	ЕСТЬNULL(Поставка.ATA, ДАТАВРЕМЯ(1, 1, 1)) КАК ShipmentATA,
		               |	ВЫБОР
		               |		КОГДА КонсолидированныйПакетЗаявокНаПеревозкуParcels.Ссылка ЕСТЬ NULL 
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК Local
		               |ИЗ
		               |	Справочник.Parcels.Изменения КАК ParcelsИзменения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонсолидированныйПакетЗаявокНаПеревозку.Parcels КАК КонсолидированныйПакетЗаявокНаПеревозкуParcels
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поставка.УпаковочныеЛисты КАК ПоставкаУпаковочныеЛисты
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поставка КАК Поставка
		               |				ПО ПоставкаУпаковочныеЛисты.Ссылка = Поставка.Ссылка
		               |			ПО КонсолидированныйПакетЗаявокНаПеревозкуParcels.Ссылка = ПоставкаУпаковочныеЛисты.УпаковочныйЛист
		               |				И (НЕ Поставка.Отменен)
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КонсолидированныйПакетЗаявокНаПеревозку КАК КонсолидированныйПакетЗаявокНаПеревозку
		               |			ПО КонсолидированныйПакетЗаявокНаПеревозкуParcels.Ссылка = КонсолидированныйПакетЗаявокНаПеревозку.Ссылка
		               |		ПО (КонсолидированныйПакетЗаявокНаПеревозкуParcels.Parcel = ParcelsИзменения.Ссылка)
		               |			И (НЕ КонсолидированныйПакетЗаявокНаПеревозку.Отменен)
		               |ГДЕ
		               |	ParcelsИзменения.Узел = &Узел";
		
		Запрос.УстановитьПараметр("Узел", УзелОбмена);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если НастройкаОбмена.Leg6Report Тогда
			
				Если Выборка.ShipmentATA <> Дата("00010101")
					ИЛИ Выборка.Local Тогда
				
					МассивПарселей.Добавить(Выборка.Ссылка);
				
				КонецЕсли;
			
			Иначе
			
				МассивПарселей.Добавить(Выборка.Ссылка);
			
			КонецЕсли;
		
		КонецЦикла;
		// } RGS VShamin 27.07.2015 19:29:31 - S-I-0001168
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			"Failed to select changes of node '" + УзелОбмена.Наименование + "'",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ПланыОбмена.Leg7,
			,
			ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат МассивПарселей;
	
КонецФункции

// { RGS VShamin 27.07.2015 14:16:32 - S-I-0001168
Функция ПолучитьСписокЗарегистрированныхТрипов(УзелОбмена) Экспорт
	
	МассивТрипов = Новый Массив;
	
	НачатьТранзакцию();
	
	Попытка
		ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(УзелОбмена, УзелОбмена.НомерОтправленного + 1);
		Пока ВыборкаИзменений.Следующий() Цикл
			Данные = ВыборкаИзменений.Получить();
			Если ТипЗнч(Данные) = Тип("ДокументОбъект.Trip") Тогда
				МассивТрипов.Добавить(Данные.Ссылка);
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			"Failed to select changes of node '" + УзелОбмена.Наименование + "'",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ПланыОбмена.Leg7,
			,
			ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат МассивТрипов;
	
КонецФункции // } RGS VShamin 27.07.2015 14:16:35 - S-I-0001168

Функция ПолучитьСписокЗарегистрированныхПарселейБезУстановкиНомераСооббщения(УзелОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ParcelsИзменения.Ссылка
		|ИЗ
		|	Справочник.Parcels.Изменения КАК ParcelsИзменения
		|ГДЕ
		|	ParcelsИзменения.Узел = &Узел";

	Запрос.УстановитьПараметр("Узел", УзелОбмена);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПарсельВСпискеЗарегистрированных(УзелОбмена, Парсель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1 1
		|ИЗ
		|	Справочник.Parcels.Изменения КАК ParcelsИзменения
		|ГДЕ
		|	ParcelsИзменения.Узел = &Узел
		|	И ParcelsИзменения.Ссылка = &Парсель";

	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	Запрос.УстановитьПараметр("Парсель", Парсель);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПолучитьСоответствиеУзловОбменаИСервисПровайдеров(ТолькоСНастройкойВыгрузки = Истина) Экспорт

	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьСоответствиеУзловОбменаИСервисПровайдеров(ТолькоСНастройкойВыгрузки);

КонецФункции

Функция ПолучитьСоответствиеУзловОбменаИCCA() Экспорт

	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьСоответствиеУзловОбменаИCCA();

КонецФункции

Функция ПолучитьУзелОбменаПоСервисПровайдеру(СервисПровайдер) Экспорт
	
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьУзелОбменаПоСервисПровайдеру(СервисПровайдер);
	
КонецФункции

Функция СервисПровайдерУчаствуетВОбмене(СервисПровайдер) Экспорт
	
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.СервисПровайдерУчаствуетВОбмене(СервисПровайдер);
	
КонецФункции

Функция ПолучитьДатыНачалаВыгрузкиДокументовПоСкладам(УзелОбмена) Экспорт

	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьДатыНачалаВыгрузкиДокументовПоСкладам(УзелОбмена);

КонецФункции // ()

Функция ДокументНеБудетВыгружатьсяПоДатеНачалаВыгрузки(ДатаДокумента, Склад, СервисПровайдер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(Leg7ДатыНачалаВыгрузкиДокументовПоСкладам.ДатаНачалаВыгрузкиДокументов), ДАТАВРЕМЯ(1,1,1)) КАК ДатаНачалаВыгрузкиДокументов
	|ИЗ
	|	ПланОбмена.Leg7.ДатыНачалаВыгрузкиДокументовПоСкладам КАК Leg7ДатыНачалаВыгрузкиДокументовПоСкладам
	|ГДЕ
	|	Leg7ДатыНачалаВыгрузкиДокументовПоСкладам.Ссылка.ServiceProvider = &ServiceProvider
	|	И Leg7ДатыНачалаВыгрузкиДокументовПоСкладам.Склад = &Склад";
	
	Запрос.УстановитьПараметр("ServiceProvider", СервисПровайдер);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат ДатаДокумента < Выборка.ДатаНачалаВыгрузкиДокументов;
	
КонецФункции

Процедура ЗарегистрироватьПарселиТрипаПриНеобходимости(УзелОбмена, Трип) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ
		|	Справочник.Parcels.Изменения КАК ParcelsИзменения
		|ГДЕ
		|	ParcelsИзменения.Узел = &Узел
		|	И ParcelsИзменения.Ссылка В(&МассивПарселей)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	1
		|ИЗ
		|	Документ.Trip.Изменения КАК TripИзменения
		|ГДЕ
		|	TripИзменения.Узел = &Узел
		|	И TripИзменения.Ссылка = &Трип";
		
		
	МассивПарселей = Трип.Parcels.ВыгрузитьКолонку("Parcel");
	Запрос.УстановитьПараметр("МассивПарселей", МассивПарселей);
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	Запрос.УстановитьПараметр("Трип", Трип.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Трип.Ссылка) Тогда
		Для каждого ТекПарсель Из МассивПарселей Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ТекПарсель);
		КонецЦикла;
	Иначе
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Трип.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНастройкуОбмена(УзелОбмена , ПроверятьГУИД = Ложь) Экспорт
	
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьНастройкуОбмена(УзелОбмена, ПроверятьГУИД);
	
КонецФункции

// { RGS VShamin 25.08.2015 13:09:44 - получение признака обмена Leg6
Функция ПолучитьИспользованиеLeg6ReportДляCCA(CCA) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьИспользованиеLeg6ReportДляCCA(CCA);
	
КонецФункции // } RGS VShamin 25.08.2015 13:09:44 - получение признака обмена Leg6

// { RGS LHristyc 29.06.2018 17:28:50 - S-I-0004942
Функция ПолучитьИспользованиеExportReportsДляCCA(CCA) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПолучитьИспользованиеExportReportsДляCCA(CCA);
	
КонецФункции // } RGS LHristyc 29.06.2018 17:29:06 - S-I-0004942

Функция РасширенныйСоставРедактируемыхПолейLeg6(CCA) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.РасширенныйСоставРедактируемыхПолейLeg6(CCA);
	
КонецФункции // } RGS VShamin 25.08.2015 13:09:44 - получение признака обмена Leg6

// { RGS VShamin 25.08.2015 13:09:44 - проверка Process level
Функция ПроверитьProcessLevelПоCCA(CCA, ProcessLevel) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Возврат LocalDistributionОбменДаннымиСерверПовтИспСеанс.ПроверитьProcessLevelПоCCA(CCA, ProcessLevel);
	
КонецФункции // } RGS VShamin 25.08.2015 13:09:44 - проверка Process level

#КонецЕсли
